test_cases/test_blob/constant/diluteDiffusionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      diluteDiffusionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// n-Butylacetate as dilute

// taken from the approximate diffusion constant from ethanol
//DC              DC [ 0 2 -1 0 0 0 0 ] 1e-8;
DC              DC [ 0 2 -1 0 0 0 0 ] 1e-8;

// 1 / Henrys constant
// for butyl acetate in water => 0.01256
H               H [ 0 0 0 0 0 0 0 ] 0.01256;

// ************************************************************************* //
